src/toir_cfe/src/Reports/торо_ПрямыеЗатратыНаВыполнениеРемонтов/торо_ПрямыеЗатратыНаВыполнениеРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17cb203d-dd43-4ad5-87cf-6155af1f0540">
  <name>торо_ПрямыеЗатратыНаВыполнениеРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

src/toir_cfe/src/InformationRegisters/торо_ОбщиеДанныеПоРемонтам/торо_ОбщиеДанныеПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1b8fbeca-59ee-4207-b4da-c1fdb926cf07">
  <name>торо_ОбщиеДанныеПоРемонтам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ca7de41a-4380-42d3-b93b-3d14a13ce3d9">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a534769e-5beb-4b57-b3af-d138e38afe8e">
    <name>ЕстьЗаявка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e320ae57-9da9-47dd-9d22-4265d1574beb">
    <name>ЕстьНаряд</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="26632482-bdd2-4881-af87-d856096d8d30">
    <name>ЕстьАкт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d55a38b3-ccd6-42d5-ae8f-6fe7a5e3b7e3">
    <name>ЕстьАктПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f7d027da-099e-47c1-b6c6-76397094ed0e">
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="646d6d26-3edf-4e80-88ae-f94e1a83e51d">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="760d81bf-833c-42a4-8d1e-f2df012d64e5">
    <name>Замещен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="ba85eb5c-9b6e-4b48-91c7-27de33dd2f16">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="088d9db2-1a15-4bff-99d4-26bc08da07cd">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8d7e3dc7-96eb-4e67-9634-d1e75420b4bb">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="60e67476-1608-4996-b48f-ffa74f993732">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="332898fd-fb46-4e34-af0e-1450d855fac1">
    <name>ПодразделениеИнициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="442326ff-0b99-4a6d-81af-fa819b4a7b89">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="09bf821b-96d8-44ff-a873-1aa963572a34">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="72058171-1407-4dd6-aab0-0f72afd60d2a">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="168c85e9-3bb0-431a-ae6e-08c455b37fa5">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="9f5d4e4f-bee5-4929-ac3d-e4200cf1416f">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a6306ae3-4e8a-4225-8afa-a01e16f34954">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="85c92d14-1c04-44bd-9284-befe63c7394c">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="605b0bf5-59d2-473b-b6f9-85ceca4cd110">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="14bdc774-4023-4716-9f09-d781c7bbfaa3">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="e5c19e7b-9d94-485e-a787-06a5e549f3a3">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="feb44686-9afe-4012-82e8-e2e090412480">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b3a0ce45-03a8-440c-8d44-e71cbb504596">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="7bae5f7e-d12f-42ac-85bb-ef8f585e5de0">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c494d197-1312-4754-a0ef-be70a3b0680e">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="59d10202-2ada-40ff-99e3-6f93a4ebcc29">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Enums/торо_ВидыДокументовНачалаЦепочкиРемонтов/торо_ВидыДокументовНачалаЦепочкиРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9a4a271c-3df6-45ca-a18a-c3a215a23313">
  <name>торо_ВидыДокументовНачалаЦепочкиРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="567a12d3-c608-43f0-a336-d5f773d2a52a">
    <name>ВнешнееОснованиеДляРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="71d3ac2c-00e7-4f96-8907-382131bb091a">
    <name>ВыявленныйДефект</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="567318ad-fa36-4a40-8027-655e8c8f1c0b">
    <name>ПланГрафикППР</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dddfb2af-bfea-4ecb-bce9-f89ad241fcdb">
    <name>ГрафикРегламентныхМероприятий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Enums/СпособыСтроительства/СпособыСтроительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5fbd54c9-ad4a-4147-8009-4ee5b1befa8f">
  <name>СпособыСтроительства</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0558d129-3d89-4535-b823-e42b39e1c5c6">
    <name>Подрядный</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="43d08372-f824-466a-b828-f37e49508b58">
    <name>Хозспособ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Documents/торо_ЗаявкаНаРемонт/торо_ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="145aacdb-f868-47fa-a11a-64c1ee401e0c">
  <name>торо_ЗаявкаНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0897f476-6166-46f5-b06b-269173e4520e">
    <name>проф_СтатусСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="03e32b56-c47c-4bc5-93ac-0da2e38d3c38">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8e0e-2544-4812-8554-4a3ee2dc14b2">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ed39b61-bbcb-4d6e-853d-79611e8e5aff">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f6af02a-4b40-4613-8cc7-8b4a64e0e244">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ccc4499d-64f9-48a4-98c6-612249fc206f">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="45912545-c381-435b-9239-8860ec2db3af">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Reports/торо_ПрямыеЗатратыНаВыполнениеРемонтов/ObjectModule.bsl
&Вместо("ПриКомпоновкеРезультата")
Процедура проф_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ТекИерархия = торо_ОтчетыСервер.ПолучитьЗначениеСтруктурыИерархии(КомпоновщикНастроек);
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаОкончания");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.Объект КАК Объект,
		|	ВТ_Данные.ВидРемонта КАК ВидРемонта,
		|	ВТ_Данные.Приоритет КАК Приоритет,
		|	ВТ_Данные.ДатаРемонта КАК ДатаРемонта,
		|	ВТ_Данные.ВсегоСумма КАК ВсегоСумма,
		|	ВТ_Данные.ТрудозатратыСумма КАК ТрудозатратыСумма,
		|	ВТ_Данные.МатериальныеЗатратыСумма КАК МатериальныеЗатратыСумма,
		|	ВТ_Данные.ЗатратыЗапчастейСумма КАК ЗатратыЗапчастейСумма,
		|	ВТ_Данные.СпособВыполнения КАК СпособВыполнения,
		|	ВТ_Данные.ID КАК ID,
		|	ВТ_Данные.Регистратор КАК Регистратор,
		//++ Проф-ИТ, #126, Соловьев А.А., 21.12.2023
		|	0 КАК СуммаПлановая,
		|	0 КАК СуммаФактическая,
		|	0 КАК ОтклонениеСумма,
		|	0 КАК ОтклонениеПроцент,
		|	ЗНАЧЕНИЕ(Справочник.проф_НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиПлан,
		|	ЗНАЧЕНИЕ(Справочник.проф_НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиФакт,
		//-- Проф-ИТ, #126, Соловьев А.А., 21.12.2023
		|	ВТ_Данные.Объект." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
	
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ
		|	ВТ_Данные.Объект КАК Объект,
		|	ВТ_Данные.ВидРемонта КАК ВидРемонта,
		|	ВТ_Данные.Приоритет КАК Приоритет,
		|	ВТ_Данные.ДатаРемонта КАК ДатаРемонта,
		|	ВТ_Данные.ВсегоСумма КАК ВсегоСумма,
		|	ВТ_Данные.ТрудозатратыСумма КАК ТрудозатратыСумма,
		|	ВТ_Данные.МатериальныеЗатратыСумма КАК МатериальныеЗатратыСумма,
		|	ВТ_Данные.ЗатратыЗапчастейСумма КАК ЗатратыЗапчастейСумма,
		|	ВТ_Данные.СпособВыполнения КАК СпособВыполнения,
		|	ВТ_Данные.ID КАК ID,
		|	ВТ_Данные.Регистратор КАК Регистратор,
		//++ Проф-ИТ, #126, Соловьев А.А., 21.12.2023
		|	0 КАК СуммаПлановая,
		|	0 КАК СуммаФактическая,
		|	0 КАК ОтклонениеСумма,
		|	0 КАК ОтклонениеПроцент,
		|	ЗНАЧЕНИЕ(Справочник.проф_НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиПлан,
		|	ЗНАЧЕНИЕ(Справочник.проф_НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиФакт,
		//-- Проф-ИТ, #126, Соловьев А.А., 21.12.2023
		|	ВТ_Данные.Объект КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
		
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ПолучитьСодержательнуюЧастьЗапроса")
Функция проф_ПолучитьСодержательнуюЧастьЗапроса()
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОбщиеДанныеПоРемонтам.IDРемонта КАК IDРемонта,
	|	торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ОбщиеДанныеПоРемонтам.ВидРемонта КАК ВидРемонта,
	|	торо_ОбщиеДанныеПоРемонтам.ЕстьЗаявка КАК ЕстьЗаявка,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ДатаНачала,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ДатаОкончания,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки КАК Документ
	|ПОМЕСТИТЬ ВТ_РемонтыПланВсе
	|ИЗ
	|	РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО торо_ОбщиеДанныеПоРемонтам.IDРемонта = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|ГДЕ
	|	НЕ торо_ОбщиеДанныеПоРемонтам.Отменен
	|	И НЕ торо_ОбщиеДанныеПоРемонтам.Замещен
	|	И ВЫБОР
	|			КОГДА торо_АктуальныеПлановыеДатыРемонтов.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ВыявленныйДефект)
	|				ТОГДА &УчитыватьСметыПоДефектам
	|						И торо_ОбщиеДанныеПоРемонтам.ЕстьЗаявка
	|			КОГДА торо_АктуальныеПлановыеДатыРемонтов.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ВнешнееОснованиеДляРабот)
	|				ТОГДА &УчитыватьСметыПоВнешнимОснованиям
	|						И торо_ОбщиеДанныеПоРемонтам.ЕстьЗаявка
	|			КОГДА торо_АктуальныеПлановыеДатыРемонтов.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ПланГрафикППР)
	|				ТОГДА &УчитыватьППР
	|			КОГДА торо_АктуальныеПлановыеДатыРемонтов.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ГрафикРегламентныхМероприятий)
	|				ТОГДА &УчитыватьРегламентныеМероприятия
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|{ГДЕ
	|	(торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала <= &ДатаОкончания
	|			И торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала >= &ДатаНачала)}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗаявкиПоРемонтамСрезПоследних.IDРемонта КАК IDРемонта,
	|	торо_ЗаявкиПоРемонтамСрезПоследних.ДокументЗаявка КАК ДокументЗаявка
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
	|			,
	|			IDРемонта В
	|				(ВЫБРАТЬ
	|					ВТ_РемонтыПланВсе.IDРемонта
	|				ИЗ
	|					ВТ_РемонтыПланВсе КАК ВТ_РемонтыПланВсе)) КАК торо_ЗаявкиПоРемонтамСрезПоследних
	|ГДЕ
	|	НЕ торо_ЗаявкиПоРемонтамСрезПоследних.Отменен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеИсполнителиРемонтов.IDРемонта КАК IDРемонта,
	|	МИНИМУМ(торо_ПлановыеИсполнителиРемонтов.СпособВыполнения) КАК СпособВыполнения
	|ПОМЕСТИТЬ ВТ_СпособыВыполнения
	|ИЗ
	|	РегистрСведений.торо_ПлановыеИсполнителиРемонтов КАК торо_ПлановыеИсполнителиРемонтов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтыПланВсе КАК ВТ_РемонтыПланВсе
	|		ПО торо_ПлановыеИсполнителиРемонтов.IDРемонта = ВТ_РемонтыПланВсе.IDРемонта
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПлановыеИсполнителиРемонтов.IDРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РемонтыПланВсе.IDРемонта КАК IDРемонта,
	|	ВТ_РемонтыПланВсе.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_РемонтыПланВсе.ВидРемонта КАК ВидРемонта,
	|	ВТ_РемонтыПланВсе.ЕстьЗаявка КАК ЕстьЗаявка,
	|	ВТ_РемонтыПланВсе.ДатаНачала КАК ДатаНачала,
	|	ВТ_РемонтыПланВсе.ДатаОкончания КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_Заявки.ДокументЗаявка, ЕСТЬNULL(торо_ПроектныеЗатратыНаРемонты.Ссылка, ВТ_РемонтыПланВсе.Документ)) КАК ДокументПлан,
	|	ЕСТЬNULL(ВТ_СпособыВыполнения.СпособВыполнения, ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)) КАК СпособВыполнения,
	|	ЕСТЬNULL(ВТ_Заявки.ДокументЗаявка, ВТ_РемонтыПланВсе.Документ) КАК Регистратор
	|ПОМЕСТИТЬ ВТ_РемонтыПлан
	|ИЗ
	|	ВТ_РемонтыПланВсе КАК ВТ_РемонтыПланВсе
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	|		ПО ВТ_РемонтыПланВсе.IDРемонта = ВТ_Заявки.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпособыВыполнения КАК ВТ_СпособыВыполнения
	|		ПО ВТ_РемонтыПланВсе.IDРемонта = ВТ_СпособыВыполнения.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПроектныеЗатратыНаРемонты КАК торо_ПроектныеЗатратыНаРемонты
	|		ПО ВТ_РемонтыПланВсе.IDРемонта = торо_ПроектныеЗатратыНаРемонты.IDРемонта
	|			И (НЕ ВТ_РемонтыПланВсе.ЕстьЗаявка)
	|			И (НЕ торо_ПроектныеЗатратыНаРемонты.ПометкаУдаления)
	|{ГДЕ
	|	ЕСТЬNULL(ВТ_СпособыВыполнения.СпособВыполнения, ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Хозспособ)) = &СпособВыполнения}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта,
	|	ДокументПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РемонтыПлан.IDРемонта КАК IDРемонта,
	|	ВТ_РемонтыПлан.ДокументПлан КАК ДокументПлан,
	|	ВТ_РемонтыПлан.ДатаНачала КАК ДатаРемонта,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура КАК Номенклатура,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Количество) КАК Количество,
	|	0 КАК КоличествоЗапчасти
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	ВТ_РемонтыПлан КАК ВТ_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеМатериальныеЗатратыРемонтныхРабот КАК торо_ПлановыеМатериальныеЗатратыРемонтныхРабот
	|		ПО ВТ_РемонтыПлан.IDРемонта = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID
	|			И ВТ_РемонтыПлан.ДокументПлан = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры,
	|	ВТ_РемонтыПлан.IDРемонта,
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура,
	|	ВТ_РемонтыПлан.ДокументПлан
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РемонтыПлан.IDРемонта,
	|	ВТ_РемонтыПлан.ДокументПлан,
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	торо_ПроектныеЗатратыНаРемонтыМатериальныеЗатраты.Номенклатура,
	|	торо_ПроектныеЗатратыНаРемонтыМатериальныеЗатраты.ХарактеристикаНоменклатуры,
	|	СУММА(торо_ПроектныеЗатратыНаРемонтыМатериальныеЗатраты.Количество),
	|	0
	|ИЗ
	|	ВТ_РемонтыПлан КАК ВТ_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПроектныеЗатратыНаРемонты.МатериальныеЗатраты КАК торо_ПроектныеЗатратыНаРемонтыМатериальныеЗатраты
	|		ПО ВТ_РемонтыПлан.ДокументПлан = торо_ПроектныеЗатратыНаРемонтыМатериальныеЗатраты.Ссылка.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПроектныеЗатратыНаРемонтыМатериальныеЗатраты.ХарактеристикаНоменклатуры,
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	ВТ_РемонтыПлан.IDРемонта,
	|	торо_ПроектныеЗатратыНаРемонтыМатериальныеЗатраты.Номенклатура,
	|	ВТ_РемонтыПлан.ДокументПлан
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РемонтыПлан.IDРемонта,
	|	ВТ_РемонтыПлан.ДокументПлан,
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура,
	|	торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры,
	|	0,
	|	СУММА(торо_ПлановыеЗатратыЗапчастей.Количество)
	|ИЗ
	|	ВТ_РемонтыПлан КАК ВТ_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеЗатратыЗапчастей КАК торо_ПлановыеЗатратыЗапчастей
	|		ПО ВТ_РемонтыПлан.IDРемонта = торо_ПлановыеЗатратыЗапчастей.РемонтыОборудования_ID
	|			И ВТ_РемонтыПлан.ДокументПлан = торо_ПлановыеЗатратыЗапчастей.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	ВТ_РемонтыПлан.IDРемонта,
	|	торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура,
	|	ВТ_РемонтыПлан.ДокументПлан
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РемонтыПлан.IDРемонта,
	|	ВТ_РемонтыПлан.ДокументПлан,
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	торо_ПроектныеЗатратыНаРемонтыЗапчасти.Номенклатура,
	|	торо_ПроектныеЗатратыНаРемонтыЗапчасти.ХарактеристикаНоменклатуры,
	|	0,
	|	СУММА(торо_ПроектныеЗатратыНаРемонтыЗапчасти.Количество)
	|ИЗ
	|	ВТ_РемонтыПлан КАК ВТ_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПроектныеЗатратыНаРемонты.Запчасти КАК торо_ПроектныеЗатратыНаРемонтыЗапчасти
	|		ПО ВТ_РемонтыПлан.ДокументПлан = торо_ПроектныеЗатратыНаРемонтыЗапчасти.Ссылка.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	торо_ПроектныеЗатратыНаРемонтыЗапчасти.Номенклатура,
	|	торо_ПроектныеЗатратыНаРемонтыЗапчасти.ХарактеристикаНоменклатуры,
	|	ВТ_РемонтыПлан.IDРемонта,
	|	ВТ_РемонтыПлан.ДокументПлан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	ДатаРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаНоменклатуры.ДатаРемонта КАК ДатаРемонта,
	|	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК ДатаРегистр,
	|	ЦеныНоменклатуры.ВидЦены КАК ТипЦены
	|ПОМЕСТИТЬ ДатаРегистраЦены
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.торо_ТипЦеныДляРасчетаСебестоимостиРемонта КАК торо_ТипЦеныДляРасчетаСебестоимостиРемонта
	|			ПО ЦеныНоменклатуры.ВидЦены = торо_ТипЦеныДляРасчетаСебестоимостиРемонта.Значение
	|		ПО ТаблицаНоменклатуры.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ТаблицаНоменклатуры.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.Характеристика
	|			И ТаблицаНоменклатуры.ДатаРемонта >= ЦеныНоменклатуры.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНоменклатуры.Номенклатура,
	|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры,
	|	ТаблицаНоменклатуры.ДатаРемонта,
	|	ЦеныНоменклатуры.ВидЦены
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаРегистр,
	|	Номенклатура,
	|	ТипЦены,
	|	ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаРегистраЦены.ДатаРемонта КАК ДатаРемонта,
	|	ДатаРегистраЦены.Номенклатура КАК Номенклатура,
	|	ДатаРегистраЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ЦеныНоменклатуры.Валюта КАК Валюта
	|ПОМЕСТИТЬ ЦенаНоменклатуры
	|ИЗ
	|	ДатаРегистраЦены КАК ДатаРегистраЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ДатаРегистраЦены.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ДатаРегистраЦены.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.Характеристика
	|			И ДатаРегистраЦены.ТипЦены = ЦеныНоменклатуры.ВидЦены
	|			И ДатаРегистраЦены.ДатаРегистр = ЦеныНоменклатуры.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	ДатаРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.IDРемонта КАК IDРемонта,
	|	ТаблицаНоменклатуры.ДокументПлан КАК ДокументПлан,
	|	ЦенаНоменклатуры.ДатаРемонта КАК ДатаРемонта,
	|	СУММА(ТаблицаНоменклатуры.Количество * ЦенаНоменклатуры.Цена) КАК Сумма,
	|	СУММА(ТаблицаНоменклатуры.КоличествоЗапчасти * ЦенаНоменклатуры.Цена) КАК СуммаЗапчасти,
	|	ЦенаНоменклатуры.Валюта КАК Валюта
	|ПОМЕСТИТЬ СтоимостьНоменклатурыВВалюте
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЦенаНоменклатуры КАК ЦенаНоменклатуры
	|		ПО ТаблицаНоменклатуры.Номенклатура = ЦенаНоменклатуры.Номенклатура
	|			И ТаблицаНоменклатуры.ХарактеристикаНоменклатуры = ЦенаНоменклатуры.ХарактеристикаНоменклатуры
	|			И ТаблицаНоменклатуры.ДатаРемонта = ЦенаНоменклатуры.ДатаРемонта
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНоменклатуры.IDРемонта,
	|	ЦенаНоменклатуры.Валюта,
	|	ЦенаНоменклатуры.ДатаРемонта,
	|	ТаблицаНоменклатуры.ДокументПлан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта,
	|	ДатаРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РемонтыПлан.IDРемонта КАК IDРемонта,
	|	ВТ_РемонтыПлан.ДокументПлан КАК ДокументПлан,
	|	ВТ_РемонтыПлан.ДатаНачала КАК ДатаРемонта,
	|	СУММА(торо_ТехнологическиеОперации.Расценка * торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество * торо_ТехнологическиеОперации.НормаВремени/3600) КАК Сумма,
	|	торо_ТехнологическиеОперации.Валюта КАК Валюта
	|ПОМЕСТИТЬ ПоТехОперациямСуммаВвалюте
	|ИЗ
	|	ВТ_РемонтыПлан КАК ВТ_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК торо_ТехнологическиеОперации
	|			ПО торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота = торо_ТехнологическиеОперации.Ссылка
	|		ПО ВТ_РемонтыПлан.IDРемонта = торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтыОборудования_ID
	|			И ВТ_РемонтыПлан.ДокументПлан = торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ТехнологическиеОперации.Валюта,
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	ВТ_РемонтыПлан.IDРемонта,
	|	ВТ_РемонтыПлан.ДокументПлан
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РемонтыПлан.IDРемонта,
	|	ВТ_РемонтыПлан.ДокументПлан,
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	СУММА(торо_ТехнологическиеОперации.Расценка * торо_ПроектныеЗатратыНаРемонтыРемонтныеРаботы.Количество * торо_ТехнологическиеОперации.НормаВремени/3600),
	|	торо_ТехнологическиеОперации.Валюта
	|ИЗ
	|	ВТ_РемонтыПлан КАК ВТ_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПроектныеЗатратыНаРемонты.РемонтныеРаботы КАК торо_ПроектныеЗатратыНаРемонтыРемонтныеРаботы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехнологическиеОперации КАК торо_ТехнологическиеОперации
	|			ПО торо_ПроектныеЗатратыНаРемонтыРемонтныеРаботы.РемонтнаяРабота = торо_ТехнологическиеОперации.Ссылка
	|		ПО ВТ_РемонтыПлан.ДокументПлан = торо_ПроектныеЗатратыНаРемонтыРемонтныеРаботы.Ссылка.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ТехнологическиеОперации.Валюта,
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	ВТ_РемонтыПлан.IDРемонта,
	|	ВТ_РемонтыПлан.ДокументПлан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта,
	|	ДатаРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РемонтыПлан.IDРемонта КАК IDРемонта,
	|	ВТ_РемонтыПлан.ДатаНачала КАК ДатаНачала,
	|	ВТ_РемонтыПлан.ДатаОкончания КАК ДатаОкончания,
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Квалификация КАК Квалификация,
	|	СУММА(торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Количество * торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.ВремяРаботы) КАК ВремяРаботы,
	|	ВТ_РемонтыПлан.ДокументПлан КАК ДокументПлан
	|ПОМЕСТИТЬ ПлановыеТрудозатраты
	|ИЗ
	|	ВТ_РемонтыПлан КАК ВТ_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеТрудовыеЗатратыРемонтныхРабот КАК торо_ПлановыеТрудовыеЗатратыРемонтныхРабот
	|		ПО ВТ_РемонтыПлан.IDРемонта = торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.РемонтыОборудования_ID
	|			И ВТ_РемонтыПлан.ДокументПлан = торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РемонтыПлан.IDРемонта,
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Квалификация,
	|	ВТ_РемонтыПлан.ДатаОкончания,
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	ВТ_РемонтыПлан.ДокументПлан
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РемонтыПлан.IDРемонта,
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	ВТ_РемонтыПлан.ДатаОкончания,
	|	торо_ПроектныеЗатратыНаРемонтыТрудовыеЗатраты.Квалификация,
	|	СУММА(торо_ПроектныеЗатратыНаРемонтыТрудовыеЗатраты.Количество * торо_ПроектныеЗатратыНаРемонтыТрудовыеЗатраты.ВремяРаботы) ,
	|	ВТ_РемонтыПлан.ДокументПлан
	|ИЗ
	|	ВТ_РемонтыПлан КАК ВТ_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПроектныеЗатратыНаРемонты.ТрудовыеЗатраты КАК торо_ПроектныеЗатратыНаРемонтыТрудовыеЗатраты
	|		ПО ВТ_РемонтыПлан.ДокументПлан = торо_ПроектныеЗатратыНаРемонтыТрудовыеЗатраты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РемонтыПлан.IDРемонта,
	|	торо_ПроектныеЗатратыНаРемонтыТрудовыеЗатраты.Квалификация,
	|	ВТ_РемонтыПлан.ДатаОкончания,
	|	ВТ_РемонтыПлан.ДатаНачала,
	|	ВТ_РемонтыПлан.ДокументПлан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квалификация,
	|	ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеТрудозатраты.ДатаОкончания КАК ДатаОкончания,
	|	ПлановыеТрудозатраты.Квалификация КАК Квалификация,
	|	МАКСИМУМ(торо_СтоимостьЧасаКвалификации.Период) КАК Период
	|ПОМЕСТИТЬ СтоипостьКвалификацийПериодыРегистра
	|ИЗ
	|	ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК торо_СтоимостьЧасаКвалификации
	|		ПО ПлановыеТрудозатраты.Квалификация = торо_СтоимостьЧасаКвалификации.Квалификация
	|			И ПлановыеТрудозатраты.ДатаОкончания >= торо_СтоимостьЧасаКвалификации.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатраты.Квалификация,
	|	ПлановыеТрудозатраты.ДатаОкончания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Квалификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоипостьКвалификацийПериодыРегистра.ДатаОкончания КАК ДатаОкончания,
	|	СтоипостьКвалификацийПериодыРегистра.Квалификация КАК Квалификация,
	|	торо_СтоимостьЧасаКвалификации.Валюта КАК Валюта,
	|	торо_СтоимостьЧасаКвалификации.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ СтоимостиКвалификаций
	|ИЗ
	|	СтоипостьКвалификацийПериодыРегистра КАК СтоипостьКвалификацийПериодыРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК торо_СтоимостьЧасаКвалификации
	|		ПО СтоипостьКвалификацийПериодыРегистра.Квалификация = торо_СтоимостьЧасаКвалификации.Квалификация
	|			И СтоипостьКвалификацийПериодыРегистра.Период = торо_СтоимостьЧасаКвалификации.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квалификация,
	|	ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеТрудозатраты.IDРемонта КАК IDРемонта,
	|	ПлановыеТрудозатраты.ДатаНачала КАК ДатаНачала,
	|	ПлановыеТрудозатраты.ДатаОкончания КАК ДатаОкончания,
	|	СУММА(СтоимостиКвалификаций.Стоимость * ПлановыеТрудозатраты.ВремяРаботы / 3600) КАК Сумма,
	|	СтоимостиКвалификаций.Валюта КАК Валюта,
	|	ПлановыеТрудозатраты.ДокументПлан КАК ДокументПлан
	|ПОМЕСТИТЬ ТрудозатратыСуммаПоКвалификациямВВалюте
	|ИЗ
	|	ПлановыеТрудозатраты КАК ПлановыеТрудозатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтоимостиКвалификаций КАК СтоимостиКвалификаций
	|		ПО ПлановыеТрудозатраты.Квалификация = СтоимостиКвалификаций.Квалификация
	|			И ПлановыеТрудозатраты.ДатаОкончания = СтоимостиКвалификаций.ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатраты.IDРемонта,
	|	ПлановыеТрудозатраты.ДатаОкончания,
	|	ПлановыеТрудозатраты.ДатаНачала,
	|	СтоимостиКвалификаций.Валюта,
	|	ПлановыеТрудозатраты.ДокументПлан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта,
	|	ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтоимостьНоменклатурыВВалюте.ДатаРемонта КАК ДатаРемонта,
	|	СтоимостьНоменклатурыВВалюте.Валюта КАК Валюта
	|ПОМЕСТИТЬ ДанныеВалюта
	|ИЗ
	|	СтоимостьНоменклатурыВВалюте КАК СтоимостьНоменклатурыВВалюте
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПоТехОперациямСуммаВвалюте.ДатаРемонта,
	|	ПоТехОперациямСуммаВвалюте.Валюта
	|ИЗ
	|	ПоТехОперациямСуммаВвалюте КАК ПоТехОперациямСуммаВвалюте
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.ДатаНачала,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.Валюта
	|ИЗ
	|	ТрудозатратыСуммаПоКвалификациямВВалюте КАК ТрудозатратыСуммаПоКвалификациямВВалюте
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта,
	|	ДатаРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеВалюта.ДатаРемонта КАК ДатаРемонта,
	|	КурсыВалют.Валюта КАК Валюта,
	|	МАКСИМУМ(КурсыВалют.Период) КАК Период
	|ПОМЕСТИТЬ ДатыРегистраКурсов
	|ИЗ
	|	ДанныеВалюта КАК ДанныеВалюта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ДанныеВалюта.Валюта = КурсыВалют.Валюта
	|			И ДанныеВалюта.ДатаРемонта >= КурсыВалют.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеВалюта.ДатаРемонта,
	|	КурсыВалют.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыРегистраКурсов.ДатаРемонта КАК ДатаРемонта,
	|	ДатыРегистраКурсов.Валюта КАК Валюта,
	|	ЕСТЬNULL(КурсыВалют.Курс, 1) КАК Курс,
	|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК Кратность
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	ДатыРегистраКурсов КАК ДатыРегистраКурсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ДатыРегистраКурсов.Валюта = КурсыВалют.Валюта
	|			И ДатыРегистраКурсов.Период = КурсыВалют.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта,
	|	ДатаРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьНоменклатурыВВалюте.IDРемонта КАК IDРемонта,
	|	СтоимостьНоменклатурыВВалюте.ДокументПлан КАК ДокументПлан,
	|	СУММА(СтоимостьНоменклатурыВВалюте.Сумма * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1)) КАК МатериальныеЗатратыСумма,
	|	СУММА(СтоимостьНоменклатурыВВалюте.СуммаЗапчасти * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1)) КАК ЗатратыЗапчастейСумма
	|ПОМЕСТИТЬ ВТ_МатериальныеЗатратыВРублях
	|ИЗ
	|	СтоимостьНоменклатурыВВалюте КАК СтоимостьНоменклатурыВВалюте
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	|		ПО СтоимостьНоменклатурыВВалюте.Валюта = КурсыВалют.Валюта
	|			И СтоимостьНоменклатурыВВалюте.ДатаРемонта = КурсыВалют.ДатаРемонта
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьНоменклатурыВВалюте.IDРемонта,
	|	СтоимостьНоменклатурыВВалюте.ДокументПлан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта,
	|	ДокументПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоТехОперациямСуммаВвалюте.IDРемонта КАК IDРемонта,
	|	ПоТехОперациямСуммаВвалюте.ДокументПлан КАК ДокументПлан,
	|	СУММА(ПоТехОперациямСуммаВвалюте.Сумма * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1)) КАК ТрудозатратыСумма
	|ПОМЕСТИТЬ ВТ_ТрудовыеЗатратыВРублях
	|ИЗ
	|	ПоТехОперациямСуммаВвалюте КАК ПоТехОперациямСуммаВвалюте
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	|		ПО ПоТехОперациямСуммаВвалюте.Валюта = КурсыВалют.Валюта
	|			И ПоТехОперациямСуммаВвалюте.ДатаРемонта = КурсыВалют.ДатаРемонта
	|ГДЕ
	|	&РасчётТрудозатрат <> ""Квалификация""
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоТехОперациямСуммаВвалюте.ДокументПлан,
	|	ПоТехОперациямСуммаВвалюте.IDРемонта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.IDРемонта,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.ДокументПлан,
	|	СУММА(ТрудозатратыСуммаПоКвалификациямВВалюте.Сумма * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1))
	|ИЗ
	|	ТрудозатратыСуммаПоКвалификациямВВалюте КАК ТрудозатратыСуммаПоКвалификациямВВалюте
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	|		ПО ТрудозатратыСуммаПоКвалификациямВВалюте.Валюта = КурсыВалют.Валюта
	|			И ТрудозатратыСуммаПоКвалификациямВВалюте.ДатаНачала = КурсыВалют.ДатаРемонта
	|ГДЕ
	|	&РасчётТрудозатрат = ""Квалификация""
	|
	|СГРУППИРОВАТЬ ПО
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.IDРемонта,
	|	ТрудозатратыСуммаПоКвалификациямВВалюте.ДокументПлан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта,
	|	ДокументПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РемонтыПлан.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_РемонтыПлан.ВидРемонта КАК ВидРемонта,
	|	ВТ_РемонтыПлан.ДатаНачала КАК ДатаНачала,
	|	ВТ_РемонтыПлан.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_МатериальныеЗатратыВРублях.МатериальныеЗатратыСумма КАК МатериальныеЗатратыСумма,
	|	ВТ_МатериальныеЗатратыВРублях.ЗатратыЗапчастейСумма КАК ЗатратыЗапчастейСумма,
	|	ВТ_ТрудовыеЗатратыВРублях.ТрудозатратыСумма КАК ТрудозатратыСумма,
	|	ЕСТЬNULL(ВТ_МатериальныеЗатратыВРублях.МатериальныеЗатратыСумма, 0) + ЕСТЬNULL(ВТ_МатериальныеЗатратыВРублях.ЗатратыЗапчастейСумма, 0) + ЕСТЬNULL(ВТ_ТрудовыеЗатратыВРублях.ТрудозатратыСумма, 0) КАК ВсегоСумма,
	|	ВТ_РемонтыПлан.СпособВыполнения КАК СпособВыполнения,
	|	ВТ_РемонтыПлан.IDРемонта КАК IDРемонта,
	|	ВТ_РемонтыПлан.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ДанныеПредв
	|ИЗ
	|	ВТ_РемонтыПлан КАК ВТ_РемонтыПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МатериальныеЗатратыВРублях КАК ВТ_МатериальныеЗатратыВРублях
	|		ПО ВТ_РемонтыПлан.IDРемонта = ВТ_МатериальныеЗатратыВРублях.IDРемонта
	|			И ВТ_РемонтыПлан.ДокументПлан = ВТ_МатериальныеЗатратыВРублях.ДокументПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТрудовыеЗатратыВРублях КАК ВТ_ТрудовыеЗатратыВРублях
	|		ПО ВТ_РемонтыПлан.IDРемонта = ВТ_ТрудовыеЗатратыВРублях.IDРемонта
	|			И ВТ_РемонтыПлан.ДокументПлан = ВТ_ТрудовыеЗатратыВРублях.ДокументПлан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ОбъектыРемонта.Ссылка КАК Объект,
	|	ВТ_ДанныеПредв.ВидРемонта КАК ВидРемонта,
	|	ВТ_ДанныеПредв.ДатаНачала КАК ДатаРемонта,
	|	ВТ_ДанныеПредв.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ДанныеПредв.МатериальныеЗатратыСумма КАК МатериальныеЗатратыСумма,
	|	ВТ_ДанныеПредв.ЗатратыЗапчастейСумма КАК ЗатратыЗапчастейСумма,
	|	ВТ_ДанныеПредв.ТрудозатратыСумма КАК ТрудозатратыСумма,
	|	ВТ_ДанныеПредв.ВсегоСумма КАК ВсегоСумма,
	|	ВТ_ДанныеПредв.СпособВыполнения КАК СпособВыполнения,
	|	ВТ_ДанныеПредв.IDРемонта КАК ID,
	|	ВТ_ДанныеПредв.Регистратор КАК Регистратор,
	|	торо_ОбъектыРемонта.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_ДанныеПредв КАК ВТ_ДанныеПредв
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО ВТ_ДанныеПредв.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	|ГДЕ
	|	ВТ_ДанныеПредв.ВсегоСумма <> 0
	|{ГДЕ
	|	(торо_ОбъектыРемонта.Приоритет = &Приоритет)}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ОбъектыРемонта.Ссылка,
	|	ВТ_ДанныеПредв.ВидРемонта,
	|	ВТ_ДанныеПредв.ДатаНачала,
	|	ВТ_ДанныеПредв.ДатаОкончания,
	|	ВТ_ДанныеПредв.МатериальныеЗатратыСумма,
	|	ВТ_ДанныеПредв.ЗатратыЗапчастейСумма,
	|	ВТ_ДанныеПредв.ТрудозатратыСумма,
	|	ВТ_ДанныеПредв.ВсегоСумма,
	|	ВТ_ДанныеПредв.СпособВыполнения,
	|	ВТ_ДанныеПредв.IDРемонта,
	|	ВТ_ДанныеПредв.Регистратор,
	|	торо_ОбъектыРемонта.Приоритет
	|ИЗ
	|	ВТ_ДанныеПредв КАК ВТ_ДанныеПредв
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|			ПО (торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка)
	|		ПО (ВТ_ДанныеПредв.ОбъектРемонта = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов)
	|ГДЕ
	|	ВТ_ДанныеПредв.ВсегоСумма <> 0
	|{ГДЕ
	|	(торо_ОбъектыРемонта.Приоритет = &Приоритет)}"
	
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ЗапросТекст;
	
КонецФункции
